uLipe/espFoC/source/drivers/inverter/esp32/esp_foc_inverter_mcpwm_3pwm.c
/*
 * MIT License
 *
 * Copyright (c) 2021 Felipe Neves
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

#include "sdkconfig.h"
#include "driver_q16_local.h"
#include "esp_foc_inverter_mcpwm_3pwm.h"
#include "driver/mcpwm_prelude.h"
#include "driver/gpio.h"
#include "esp_err.h"
#include "esp_log.h"
#include "soc/soc_caps.h"

#if SOC_ETM_SUPPORTED
#include "esp_foc_inverter_mcpwm_etm.h"
#endif

typedef struct {
    int enable_gpio;
    int enable_inverted;
    mcpwm_timer_handle_t timer;
    mcpwm_oper_handle_t operators[3];
    mcpwm_cmpr_handle_t comparators[3];
    mcpwm_gen_handle_t  generators[3];

    float dc_link_voltage_nominal;
    q16_t dc_link_q16;
    esp_foc_inverter_callback_t notifier;
    void *arg;
#if SOC_ETM_SUPPORTED
    inverter_mcpwm_etm_t etm;
#endif
    esp_foc_inverter_t interface;

}esp_foc_mcpwm_inverter_t;

#define MCPWM_RATE_HZ         CONFIG_ESP_FOC_PWM_RATE_HZ
#define MCPWM_RESOLUTION_HZ   160000000
#define MCPWM_PERIOD_TOP      MCPWM_RESOLUTION_HZ / MCPWM_RATE_HZ
#define MCPWM_PERIOD_TOP_HALF MCPWM_PERIOD_TOP / 2

static esp_foc_mcpwm_inverter_t mcpwms[CONFIG_NOOF_AXIS];

static mcpwm_timer_config_t timer_config = {
    .group_id = 0,
    .clk_src = MCPWM_TIMER_CLK_SRC_DEFAULT,
    .resolution_hz = MCPWM_RESOLUTION_HZ,
    .count_mode = MCPWM_TIMER_COUNT_MODE_UP_DOWN,
    .period_ticks = MCPWM_PERIOD_TOP,
};

static mcpwm_operator_config_t operator_config = {
    .group_id = 0,
};

static mcpwm_comparator_config_t compare_config = {
    .flags.update_cmp_on_tez = true,
};

static const char *TAG = "INVERTER_MCPWM";

static bool inverter_isr(mcpwm_timer_handle_t timer, const mcpwm_timer_event_data_t *edata, void *user_data)
{
    esp_foc_mcpwm_inverter_t *inverter = (esp_foc_mcpwm_inverter_t *)user_data;

    if(inverter->notifier) {
        inverter->notifier(inverter->arg);
    }

    return false;
}

const static mcpwm_timer_event_callbacks_t driver_cb = {
    .on_full = inverter_isr,
};

static q16_t dc_link_q16_from_nominal(float nominal_volts)
{
    float v = nominal_volts;
    if (v <= 0.0f) {
        v = (float)CONFIG_ESP_FOC_DC_LINK_NOMINAL_MV / 1000.0f;
    }
    if (v < 1e-6f) {
        v = 1.0f;
    }
    return q16_from_float(v);
}

static q16_t get_dc_link_voltage(esp_foc_inverter_t *self)
{
    esp_foc_mcpwm_inverter_t *obj =
        __containerof(self, esp_foc_mcpwm_inverter_t, interface);
    return obj->dc_link_q16;
}

static void set_duties(esp_foc_inverter_t *self, q16_t duty_a, q16_t duty_b, q16_t duty_c)
{
    esp_foc_mcpwm_inverter_t *obj =
        __containerof(self, esp_foc_mcpwm_inverter_t, interface);
    uint32_t ph = (uint32_t)MCPWM_PERIOD_TOP_HALF;

    mcpwm_comparator_set_compare_value(
        obj->comparators[0], (uint16_t)esp_foc_q16_duty_ticks(duty_a, ph));
    mcpwm_comparator_set_compare_value(
        obj->comparators[1], (uint16_t)esp_foc_q16_duty_ticks(duty_b, ph));
    mcpwm_comparator_set_compare_value(
        obj->comparators[2], (uint16_t)esp_foc_q16_duty_ticks(duty_c, ph));
}

static void set_inverter_callback(esp_foc_inverter_t *self,
                        esp_foc_inverter_callback_t callback,
                        void *argument)
{
    esp_foc_mcpwm_inverter_t *obj =
    __containerof(self, esp_foc_mcpwm_inverter_t, interface);

    obj->notifier = callback;
    obj->arg = argument;
}

static uint32_t get_inverter_pwm_rate(esp_foc_inverter_t *self)
{
    (void)self;
    return (uint32_t)MCPWM_RATE_HZ;
}

static void inverter_enable(esp_foc_inverter_t *self)
{
    esp_foc_mcpwm_inverter_t *obj =
        __containerof(self, esp_foc_mcpwm_inverter_t, interface);
    if (obj->enable_gpio < 0) {
        return;
    }
    gpio_set_level(obj->enable_gpio, obj->enable_inverted ? 0 : 1);
}

static void inverter_disable(esp_foc_inverter_t *self)
{
    esp_foc_mcpwm_inverter_t *obj =
        __containerof(self, esp_foc_mcpwm_inverter_t, interface);
    if (obj->enable_gpio < 0) {
        return;
    }
    gpio_set_level(obj->enable_gpio, obj->enable_inverted ? 1 : 0);
}


esp_foc_inverter_t *inverter_3pwm_mpcwm_new(int gpio_u, int gpio_v, int gpio_w, int gpio_enable,
                                        float dc_link_voltage, int port)
{
    if(port > CONFIG_NOOF_AXIS - 1) {
        return NULL;
    }

    if (gpio_enable == -1) {
        mcpwms[port].enable_gpio = -1;
        mcpwms[port].enable_inverted = 0;
    } else if (gpio_enable < -1) {
        mcpwms[port].enable_gpio = -gpio_enable;
        mcpwms[port].enable_inverted = 1;
    } else {
        mcpwms[port].enable_gpio = gpio_enable;
        mcpwms[port].enable_inverted = 0;
    }

    if (mcpwms[port].enable_gpio >= 0) {
        gpio_config_t drv_en_config = {
            .mode = GPIO_MODE_OUTPUT,
            .pin_bit_mask = 1ULL << (unsigned int)mcpwms[port].enable_gpio,
        };
        gpio_config(&drv_en_config);
        gpio_set_level(
            mcpwms[port].enable_gpio,
            mcpwms[port].enable_inverted ? 1 : 0);
    }

    mcpwms[port].dc_link_voltage_nominal = dc_link_voltage;
    mcpwms[port].dc_link_q16 = dc_link_q16_from_nominal(dc_link_voltage);
    mcpwms[port].interface.get_dc_link_voltage = get_dc_link_voltage;
    mcpwms[port].interface.set_duties = set_duties;
    mcpwms[port].interface.set_inverter_callback = set_inverter_callback;
    mcpwms[port].interface.get_inverter_pwm_rate = get_inverter_pwm_rate;
    mcpwms[port].interface.enable = inverter_enable;
    mcpwms[port].interface.disable = inverter_disable;
    mcpwms[port].notifier = NULL;

    timer_config.group_id = port;
    mcpwm_new_timer(&timer_config, &mcpwms[port].timer);

    operator_config.group_id = port;
    for (int i = 0; i < 3; i++) {
        mcpwm_new_operator(&operator_config, &mcpwms[port].operators[i]);
        mcpwm_operator_connect_timer(mcpwms[port].operators[i], mcpwms[port].timer);
    }

    for (int i = 0; i < 3; i++) {
        mcpwm_new_comparator(mcpwms[port].operators[i], &compare_config, &mcpwms[port].comparators[i]);
        mcpwm_comparator_set_compare_value(mcpwms[port].comparators[i], 0);
    }

    mcpwm_generator_config_t gen_config = {};
    gen_config.gen_gpio_num = gpio_u;
    mcpwm_new_generator(mcpwms[port].operators[0], &gen_config, &mcpwms[port].generators[0]);
    gen_config.gen_gpio_num = gpio_v;
    mcpwm_new_generator(mcpwms[port].operators[1], &gen_config, &mcpwms[port].generators[1]);
    gen_config.gen_gpio_num = gpio_w;
    mcpwm_new_generator(mcpwms[port].operators[2], &gen_config, &mcpwms[port].generators[2]);

    for (int i = 0; i < 3; i++) {

        mcpwm_generator_set_actions_on_compare_event(mcpwms[port].generators[i],
                            MCPWM_GEN_COMPARE_EVENT_ACTION(MCPWM_TIMER_DIRECTION_UP,
                                                        mcpwms[port].comparators[i],
                                                        MCPWM_GEN_ACTION_LOW),
                            MCPWM_GEN_COMPARE_EVENT_ACTION(MCPWM_TIMER_DIRECTION_DOWN,
                                                        mcpwms[port].comparators[i],
                                                        MCPWM_GEN_ACTION_HIGH),
                            MCPWM_GEN_COMPARE_EVENT_ACTION_END());
    }

#if SOC_ETM_SUPPORTED
    if (inverter_mcpwm_etm_init(&mcpwms[port].etm, mcpwms[port].operators[0],
                                (uint32_t)MCPWM_PERIOD_TOP) == ESP_OK) {
        inverter_mcpwm_etm_register(&mcpwms[port].interface, &mcpwms[port].etm);
    } else {
        ESP_LOGW(TAG, "MCPWM ETM trigger init failed");
    }
#endif

    mcpwm_timer_register_event_callbacks(mcpwms[port].timer, &driver_cb, &mcpwms[port]);
    mcpwm_timer_enable(mcpwms[port].timer);
    mcpwm_timer_start_stop(mcpwms[port].timer, MCPWM_TIMER_START_NO_STOP);

    ESP_LOGI(TAG,"Inverter driver is ready for use, intance %p", &mcpwms[port].interface);

    return &mcpwms[port].interface;
}
